problem-solving-bottom-up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-27 Mon 15:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Problem Solving: Bottom-up approach</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="erretres" />
</head>
<body>
<div id="content">
<h1 class="title">Problem Solving: Bottom-up approach</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50291cf">1. Problem Solving: Bottom-up approach</a>
<ul>
<li><a href="#orgbfe8ec1">1.1. Bottom-up  approach</a>
<ul>
<li><a href="#orge93ed14">1.1.1. Bottom-up approach common patterns</a></li>
<li><a href="#org4c59d8c">1.1.2. Calculator example (Bottom-up)</a></li>
</ul>
</li>
<li><a href="#orgadbc3bc">1.2. References</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50291cf" class="outline-2">
<h2 id="org50291cf"><span class="section-number-2">1</span> Problem Solving: Bottom-up approach</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbfe8ec1" class="outline-3">
<h3 id="orgbfe8ec1"><span class="section-number-3">1.1</span> Bottom-up  approach</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>In a bottom-up approach the problem analysis  starts at the lowest level possible</li>

<li>Individual parts of the system are implemented</li>

<li>This parts are then linked to form larger components</li>

<li>This process continues till all system components are implemented.</li>
</ul>
</div>


<div id="outline-container-orge93ed14" class="outline-4">
<h4 id="orge93ed14"><span class="section-number-4">1.1.1</span> Bottom-up approach common patterns</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
When using the bottom-up approach, there are some patterns that we can identify:
</p>

<ul class="org-ul">
<li>Most of the programs follows the  event-action paradigm[0]: 

<ul class="org-ul">
<li>Users supplies an event and</li>

<li>A sequence of actions is executed in response to that event</li>
</ul></li>

<li>Event-handlers will  execute functions in response to an event</li>

<li>Elements of the user interface may respond to an event in different ways, depending on the context</li>

<li>if-else statements are used to determine the context and which functions are executed</li>

<li>Event-handlers must use information shared between user interface objects</li>

<li>To share information the following  options are used: 

<ul class="org-ul">
<li>Explicit global variables</li>

<li>A value contained in an user interface object</li>

<li>Other attribute of an object</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org4c59d8c" class="outline-4">
<h4 id="org4c59d8c"><span class="section-number-4">1.1.2</span> Calculator example (Bottom-up)</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #d787d7; font-weight: bold;">class</span> Calculator <span style="color: #d787d7; font-weight: bold;">extends</span> React.Component <span style="color: #d787d7; font-weight: bold;">{</span>
  constructor<span style="color: #d787d7; font-weight: bold;">(</span>props<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">super(</span>props<span style="color: #d787d7; font-weight: bold;">)</span>;
    <span style="color: #d7875f; font-weight: bold;">this</span>.state = <span style="color: #d787d7; font-weight: bold;">{</span>
      currentVal: <span style="color: #87af5f;">"0"</span>,
      prevVal: <span style="color: #87af5f;">"0"</span>,
      formula: <span style="color: #87af5f;">""</span>,
      currentSign: <span style="color: #87af5f;">"pos"</span>,
      lastClicked: <span style="color: #87af5f;">""</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>;
    <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">....</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  initialize<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d7875f; font-weight: bold;">this</span>.setState<span style="color: #d787d7; font-weight: bold;">({</span>
      currentVal: <span style="color: #87af5f;">"0"</span>,
      prevVal: <span style="color: #87af5f;">"0"</span>,
      formula: <span style="color: #87af5f;">""</span>,
      currentSign: <span style="color: #87af5f;">"pos"</span>,
      lastClicked: <span style="color: #87af5f;">""</span>,
      evaluated: <span style="color: #d7875f; font-weight: bold;">false</span>
    <span style="color: #d787d7; font-weight: bold;">})</span>;
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleDecimal<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.evaluated === <span style="color: #d7875f; font-weight: bold;">true</span><span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">... </span>
    <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>
      !<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"."</span><span style="color: #d787d7; font-weight: bold;">)</span> &amp;&amp;
      !<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">)</span>
    <span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.length &gt; 21<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>
        endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.formula<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">||</span>
        <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal === <span style="color: #87af5f;">"0"</span> &amp;&amp; <span style="color: #d7875f; font-weight: bold;">this</span>.state.formula === <span style="color: #87af5f;">""</span><span style="color: #d787d7; font-weight: bold;">)</span>
      <span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
   <span style="color: #d787d7; font-weight: bold;">}</span>

  handleEvaluate<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #707070; font-style: italic;">//   </span><span style="color: #707070; font-style: italic;">...</span>
        expression = expression.replace<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">/x/</span>g, <span style="color: #87af5f;">"*"</span><span style="color: #d787d7; font-weight: bold;">)</span>.replace<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">/&#8209;/</span>g, <span style="color: #87af5f;">"-"</span><span style="color: #d787d7; font-weight: bold;">)</span>;

     <span style="color: #d787d7; font-weight: bold;">while</span> <span style="color: #d787d7; font-weight: bold;">(</span>endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span>expression<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
        expression = expression.slice<span style="color: #d787d7; font-weight: bold;">(</span>0, -1<span style="color: #d787d7; font-weight: bold;">)</span>;
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleOperators<span style="color: #d787d7; font-weight: bold;">(</span>e<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>evaluated<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span>formula<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!endsWithNegativeSign.test<span style="color: #d787d7; font-weight: bold;">(</span>formula<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>value !== <span style="color: #87af5f;">"&#8209;"</span><span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleNumbers<span style="color: #d787d7; font-weight: bold;">(</span>e<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>currentVal.length &gt; 21<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">... </span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>evaluated<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
   <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

<span style="color: #d787d7; font-weight: bold;">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgadbc3bc" class="outline-3">
<h3 id="orgadbc3bc"><span class="section-number-3">1.2</span> References</h3>
<div class="outline-text-3" id="text-1-2">
<p>
[0] <a href="https://en.wikipedia.org/wiki/Event-driven_programming">https://en.wikipedia.org/wiki/Event-driven_programming</a>
</p>

<blockquote>
<p>
In computer programming, event-driven programming is a programming paradigm in which the flow of the program is determined by events such as user actions (mouse clicks, key presses), sensor outputs, or messages from other programs or threads. Event-driven programming is the dominant paradigm used in graphical user interfaces and other applications (e.g., JavaScript web applications) that are centered on performing certain actions in response to user input. This is also true of programming for device drivers (e.g., P in USB device driver stacks). 
</p>
</blockquote>

<p>
[1] <a href="https://en.wikipedia.org/wiki/Event-driven_programming#Criticism">https://en.wikipedia.org/wiki/Event-driven_programming#Criticism</a>
</p>

<blockquote>
<p>
The design of those programs which rely on event-action model has been criticised, and it has been suggested that the event-action model leads programmers to create error-prone, difficult to extend and excessively complex application code. Table-driven state machines have been advocated as a viable alternative. On the other hand, table-driven state machines themselves suffer from significant weaknesses including state explosion phenomena. A solution for this is to use Petri nets. 
</p>
</blockquote>


<p>
[2] Constructing the User Interface with Statecharts, Ian Horrocks, 1999.  ISBN-10: 0201342782
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: erretres</p>
<p class="date">Created: 2020-07-27 Mon 15:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
